ALL_SUBJECTS = {
    ("матан", "математический анализ") : "Математический анализ",
    ("c#", "ооп", "проектирование на с#", "шарпы") : "Проектирование на C#",
    ("алгем", "алгебра и геометрия") : "Алгебра и геометрия",
    ("дискретка", "дискретная математика") : "Дискретная математика",
    ("тервер", "т*рв*р", "теория и вероятности", "теория вероятностей") : "Теория вероятностей",
    ("основы программирования на c#", "основы программирования", "ятп") : "Основы программирования",
    ("нанды", "nandtotetris", "nand-to-tetris") : "Nand-to-Tetris",
    ("опд", "основы проектной деятельности") : "Основы проектной деятельности",
    ("python", "питон", "язык python") : "Язык Python",
    ("сети", "сети и протоколы интернета") : "Сети и протоколы интернета",
    ("полезное приложение", "проектный практикум") : "Полезное приложение",
}
def find_subject(subject_name : str):
    for keys, final_subject in ALL_SUBJECTS.items():
        if subject_name.lower() in keys:
            return final_subject
    return ""